import 'all_class.dart';

List<User> users = [
  User(
    2,
    "Антон",
    30,
    "Привет, что делаешь?",
    "15:36",
    "Тренируемый",
    "3",
    true,
  ),
  // User(
  //   3,
  //   "Никита",
  //   21,
  //   "Никита, убедительная просьба, временно не покупать мне сладкое, потому что я чувствую себя каким-то наркоманом Шоколадка просто лежит на столе, а я не могу на неё просто смотреть, обязательно надо съесть. И сегодня на работе съели с девочкой целую пачку конфет + баунти, это ппц. Если я буду знать, что в комнате существует что-то сладкое, то я ж не усну ночью",
  //   "23:03",
  //   "Тренируемый",
  // ),
  // User(
  //   4,
  //   "Никита",
  //   21,
  //   "Никита, убедительная просьба, временно не покупать мне сладкое, потому что я чувствую себя каким-то наркоманом Шоколадка просто лежит на столе, а я не могу на неё просто смотреть, обязательно надо съесть. И сегодня на работе съели с девочкой целую пачку конфет + баунти, это ппц. Если я буду знать, что в комнате существует что-то сладкое, то я ж не усну ночью",
  //   "23:03",
  //   "Тренируемый",
  // ),
  // User(
  //   5,
  //   "Никита",
  //   21,
  //   "Никита, убедительная просьба, временно не покупать мне сладкое, потому что я чувствую себя каким-то наркоманом Шоколадка просто лежит на столе, а я не могу на неё просто смотреть, обязательно надо съесть. И сегодня на работе съели с девочкой целую пачку конфет + баунти, это ппц. Если я буду знать, что в комнате существует что-то сладкое, то я ж не усну ночью",
  //   "23:03",
  //   "Тренируемый",
  // ),
  // User(
  //   6,
  //   "Никита",
  //   21,
  //   "Никита, убедительная просьба, временно не покупать мне сладкое, потому что я чувствую себя каким-то наркоманом Шоколадка просто лежит на столе, а я не могу на неё просто смотреть, обязательно надо съесть. И сегодня на работе съели с девочкой целую пачку конфет + баунти, это ппц. Если я буду знать, что в комнате существует что-то сладкое, то я ж не усну ночью",
  //   "23:03",
  //   "Тренируемый",
  // ),
  // User(
  //   7,
  //   "Никита",
  //   21,
  //   "Никита, убедительная просьба, временно не покупать мне сладкое, потому что я чувствую себя каким-то наркоманом Шоколадка просто лежит на столе, а я не могу на неё просто смотреть, обязательно надо съесть. И сегодня на работе съели с девочкой целую пачку конфет + баунти, это ппц. Если я буду знать, что в комнате существует что-то сладкое, то я ж не усну ночью",
  //   "23:03",
  //   "Тренируемый",
  // ),
  // User(
  //   8,
  //   "Никита",
  //   21,
  //   "Никита, убедительная просьба, временно не покупать мне сладкое, потому что я чувствую себя каким-то наркоманом Шоколадка просто лежит на столе, а я не могу на неё просто смотреть, обязательно надо съесть. И сегодня на работе съели с девочкой целую пачку конфет + баунти, это ппц. Если я буду знать, что в комнате существует что-то сладкое, то я ж не усну ночью",
  //   "23:03",
  //   "Тренируемый",
  // ),
  // User(
  //   9,
  //   "Никита",
  //   21,
  //   "Никита, убедительная просьба, временно не покупать мне сладкое, потому что я чувствую себя каким-то наркоманом Шоколадка просто лежит на столе, а я не могу на неё просто смотреть, обязательно надо съесть. И сегодня на работе съели с девочкой целую пачку конфет + баунти, это ппц. Если я буду знать, что в комнате существует что-то сладкое, то я ж не усну ночью",
  //   "23:03",
  //   "Тренируемый",
  // ),
  // User(
  //   10,
  //   "Никита",
  //   21,
  //   "Никита, убедительная просьба, временно не покупать мне сладкое, потому что я чувствую себя каким-то наркоманом Шоколадка просто лежит на столе, а я не могу на неё просто смотреть, обязательно надо съесть. И сегодня на работе съели с девочкой целую пачку конфет + баунти, это ппц. Если я буду знать, что в комнате существует что-то сладкое, то я ж не усну ночью",
  //   "23:04",
  //   "Тренируемый",
  // ),
];

List<Message> messages = [
  Message(
    false,
    "Я короче такая просыпаюсь в 7 часов, а потом резко вспоминаю, что нам говорили, что психологии не будет на этой неделе, и я радостная дальше спать пошла)",
    "10:20",
  ),
  Message(
    true,
    "Антон",
    "10:20",
  ),
  Message(
    false,
    "Я короче такая просыпаюсь в 7 часов, а потом резко вспоминаю, что нам говорили, что психологии не будет на этой неделе, и я радостная дальше спать пошла)",
    "10:20",
  ),
  Message(
    true,
    "Антон",
    "10:20",
  ),
  Message(
    false,
    "Я короче такая просыпаюсь в 7 часов, а потом резко вспоминаю, что нам говорили, что психологии не будет на этой неделе, и я радостная дальше спать пошла)",
    "10:20",
  ),
  Message(
    true,
    "Антон",
    "10:20",
  ),
  Message(
    false,
    "Я короче такая просыпаюсь в 7 часов, а потом резко вспоминаю, что нам говорили, что психологии не будет на этой неделе, и я радостная дальше спать пошла)",
    "10:20",
  ),
  Message(
    true,
    "Антон",
    "10:20",
  ),
  Message(
    false,
    "Я короче такая просыпаюсь в 7 часов, а потом резко вспоминаю, что нам говорили, что психологии не будет на этой неделе, и я радостная дальше спать пошла)",
    "10:20",
  ),
  Message(
    true,
    "Антон",
    "10:20",
  ),
  Message(
    false,
    "Я короче такая просыпаюсь в 7 часов, а потом резко вспоминаю, что нам говорили, что психологии не будет на этой неделе, и я радостная дальше спать пошла)",
    "10:20",
  ),
  Message(
    true,
    "Антон",
    "10:20",
  ),
  Message(
    false,
    "Я короче такая просыпаюсь в 7 часов, а потом резко вспоминаю, что нам говорили, что психологии не будет на этой неделе, и я радостная дальше спать пошла)",
    "10:20",
  ),
  Message(
    true,
    "Антон",
    "10:20",
  ),
  Message(
    false,
    "Я короче такая просыпаюсь в 7 часов, а потом резко вспоминаю, что нам говорили, что психологии не будет на этой неделе, и я радостная дальше спать пошла)",
    "10:20",
  ),
];

List<Message> workout = [
  Message(
    false,
    "Я короче такая просыпаюсь в 7 часов, а потом резко вспоминаю, что нам говорили, что психологии не будет на этой неделе, и я радостная дальше спать пошла)",
    "10:20",
  ),
  Message(
    true,
    "Антон",
    "10:20",
  ),
  Message(
    false,
    "Я короче такая просыпаюсь в 7 часов, а потом резко вспоминаю, что нам говорили, что психологии не будет на этой неделе, и я радостная дальше спать пошла)",
    "10:20",
  ),
  Message(
    true,
    "Антон",
    "10:20",
  ),
  Message(
    false,
    "Я короче такая просыпаюсь в 7 часов, а потом резко вспоминаю, что нам говорили, что психологии не будет на этой неделе, и я радостная дальше спать пошла)",
    "10:20",
  ),
  Message(
    true,
    "Антон",
    "10:20",
  ),
  Message(
    false,
    "Я короче такая просыпаюсь в 7 часов, а потом резко вспоминаю, что нам говорили, что психологии не будет на этой неделе, и я радостная дальше спать пошла)",
    "10:20",
  ),
  Message(
    true,
    "Антон",
    "10:20",
  ),
  Message(
    false,
    "Я короче такая просыпаюсь в 7 часов, а потом резко вспоминаю, что нам говорили, что психологии не будет на этой неделе, и я радостная дальше спать пошла)",
    "10:20",
  ),
  Message(
    true,
    "Антон",
    "10:20",
  ),
  Message(
    false,
    "Я короче такая просыпаюсь в 7 часов, а потом резко вспоминаю, что нам говорили, что психологии не будет на этой неделе, и я радостная дальше спать пошла)",
    "10:20",
  ),
  Message(
    true,
    "Антон",
    "10:20",
  ),
  Message(
    false,
    "Я короче такая просыпаюсь в 7 часов, а потом резко вспоминаю, что нам говорили, что психологии не будет на этой неделе, и я радостная дальше спать пошла)",
    "10:20",
  ),
  Message(
    true,
    "Антон",
    "10:20",
  ),
  Message(
    false,
    "Я короче такая просыпаюсь в 7 часов, а потом резко вспоминаю, что нам говорили, что психологии не будет на этой неделе, и я радостная дальше спать пошла)",
    "10:20",
  ),
];

List<Training> training = [
  Training(
    "assets/images/workout_g.png",
    "Тренировка груди",
    "27.05.2023",
  ),
  Training(
    "assets/images/workout_n.png",
    "Тренировка ног",
    "27.05.2023",
  ),
  Training(
    "assets/images/workout_n.png",
    "Тренировка ног",
    "27.05.2023",
  ),
  Training(
    "assets/images/workout_n.png",
    "Тренировка ног",
    "27.05.2023",
  ),
];
